review.html
<!doctype html>
<html lang="en">
<head>
<title>Reviews for Energy-Efficient, Risk-Aware Control of Domestic Hot Water</title>
<!-- 2026-04-08 Wed 16:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="James Brusey">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#review">Review</a>
<ul class="nav">
<li><a href="#overall-merit">Overall merit</a></li>
<li><a href="#reviewer-expertise">Reviewer expertise</a></li>
<li><a href="#paper-summary">Paper summary</a></li>
<li><a href="#comments-for-authors">Comments for authors</a></li>
</ul>
</li>
<li><a href="#review-1">Review</a>
<ul class="nav">
<li><a href="#overall-merit-1">Overall merit</a></li>
<li><a href="#reviewer-expertise-1">Reviewer expertise</a></li>
<li><a href="#paper-summary-1">Paper summary</a></li>
<li><a href="#comments-for-authors-1">Comments for authors</a></li>
</ul>
</li>
<li><a href="#review-395a">Review #395A</a>
<ul class="nav">
<li><a href="#overall-merit-2">Overall merit</a></li>
<li><a href="#reviewer-expertise-2">Reviewer expertise</a></li>
<li><a href="#paper-summary-2">Paper summary</a></li>
<li><a href="#comments-for-authors-2">Comments for authors</a></li>
</ul>
</li>
<li><a href="#review-395b">Review #395B</a>
<ul class="nav">
<li><a href="#meta-review-by-track-chair">Meta Review by Track Chair</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Reviews for Energy-Efficient, Risk-Aware Control of Domestic Hot Water</h1>
<div id="outline-container-review" class="outline-2">
<h2 id="review"><a id="sec-" name="sec-"></a>Review</h2>
<div class="outline-text-2" id="text-review">
</div>
<div id="outline-container-overall-merit" class="outline-3">
<h3 id="overall-merit"><a id="sec-" name="sec-"></a>Overall merit</h3>
<div class="outline-text-3" id="text-overall-merit">
<ol class="org-ol">
<li value="4">Accept
</li>
</ol>
</div>
</div>
<div id="outline-container-reviewer-expertise" class="outline-3">
<h3 id="reviewer-expertise"><a id="sec-" name="sec-"></a>Reviewer expertise</h3>
<div class="outline-text-3" id="text-reviewer-expertise">
<ol class="org-ol">
<li value="2">Some familiarity
</li>
</ol>
</div>
</div>
<div id="outline-container-paper-summary" class="outline-3">
<h3 id="paper-summary"><a id="sec-" name="sec-"></a>Paper summary</h3>
<div class="outline-text-3" id="text-paper-summary">
<p>
The paper presents a comparison of different ways to control domestic
water heaters and compare them across various relevant metrics, such as
frequency of switching, energy consumption, and comfort.
</p>
</div>
</div>
<div id="outline-container-comments-for-authors" class="outline-3">
<h3 id="comments-for-authors"><a id="sec-" name="sec-"></a>Comments for authors</h3>
<div class="outline-text-3" id="text-comments-for-authors">
<p>
This paper offers a structured way to compare a collection of water
heater controllers and conclude that given the same access to
information, a structured and interpretable design does as well as (and
in some metrics, better than) a reinforcement learning based controller.
The exercise shows that blindly applying an RL algorithm, even though it
is suited to the task, may not buy one as much in terms of robustness,
efficiency, and interpretability. I enjoyed reading the paper!
</p>
</div>
</div>
</div>
<div id="outline-container-review-1" class="outline-2">
<h2 id="review-1"><a id="sec-" name="sec-"></a>Review</h2>
<div class="outline-text-2" id="text-review-1">
</div>
<div id="outline-container-overall-merit-1" class="outline-3">
<h3 id="overall-merit-1"><a id="sec-" name="sec-"></a>Overall merit</h3>
<div class="outline-text-3" id="text-overall-merit-1">
<ol class="org-ol">
<li value="2">Weak reject
</li>
</ol>
</div>
</div>
<div id="outline-container-reviewer-expertise-1" class="outline-3">
<h3 id="reviewer-expertise-1"><a id="sec-" name="sec-"></a>Reviewer expertise</h3>
<div class="outline-text-3" id="text-reviewer-expertise-1">
<ol class="org-ol">
<li value="3">Knowledgeable
</li>
</ol>
</div>
</div>
<div id="outline-container-paper-summary-1" class="outline-3">
<h3 id="paper-summary-1"><a id="sec-" name="sec-"></a>Paper summary</h3>
<div class="outline-text-3" id="text-paper-summary-1">
<p>
The paper studies reinforcement learning-based control for a domestic
hot-water heating system under stochastic demand. The experimental
section appears carefully implemented, with multiple rule-based
baselines and detailed performance comparisons.
</p>
</div>
</div>
<div id="outline-container-comments-for-authors-1" class="outline-3">
<h3 id="comments-for-authors-1"><a id="sec-" name="sec-"></a>Comments for authors</h3>
<div class="outline-text-3" id="text-comments-for-authors-1">
<p>
Major comments: 1. The related work section provides a good overview but
should more explicitly differentiate this work from existing studies on
RL-based DHW control. For instance, how does the proposed duration-aware
NHPP demand model fundamentally change the control challenge compared to
more simplistic occupancy-based triggers used in previous RL energy
studies? A more detailed comparison of the problem formulation would
clarify the specific contribution of this environment.
</p>

<ol class="org-ol">
<li value="2">The experimental comparison includes several practical
rule-based controllers, which is useful for demonstrating real-world
relevance. However, the evaluation might benefit from including at
least one stronger optimization-based baseline (for example, dynamic
programming-based policies) if feasible. Such comparisons could
provide additional insight into the achievable performance limits and
help further contextualize the RL results.
</li>

<li>The paper notes that PPO leads to significantly higher switching
frequency and energy use. The discussion could be expanded to explain
the physical cause of this behavior. Does the PPO agent learn a
dithering policy to maintain a higher safety margin? Given that relay
wear is a critical factor in appliance longevity, a deeper analysis
of this energy-comfort-switching trade-off would make the empirical
insights more valuable for real-world deployment.
</li>
</ol>

<p>
Minor comments: 1. In several figures (e.g., Figure 3 and 6), the
legends overlap with the plotted curves and partially obscure the data.
Repositioning the legends would improve clarity. 2. A brief sensitivity
analysis regarding key physical parameters, such as the heater's rated
power or the tank's loss coefficient, would demonstrate the robustness
of the value-of-information conclusion across different hardware
configurations.
</p>
</div>
</div>
</div>
<div id="outline-container-review-395a" class="outline-2">
<h2 id="review-395a"><a id="sec-" name="sec-"></a>Review #395A</h2>
<div class="outline-text-2" id="text-review-395a">
</div>
<div id="outline-container-overall-merit-2" class="outline-3">
<h3 id="overall-merit-2"><a id="sec-" name="sec-"></a>Overall merit</h3>
<div class="outline-text-3" id="text-overall-merit-2">
<ol class="org-ol">
<li value="2">Weak reject
</li>
</ol>
</div>
</div>
<div id="outline-container-reviewer-expertise-2" class="outline-3">
<h3 id="reviewer-expertise-2"><a id="sec-" name="sec-"></a>Reviewer expertise</h3>
<div class="outline-text-3" id="text-reviewer-expertise-2">
<ol class="org-ol">
<li value="3">Knowledgeable
</li>
</ol>
</div>
</div>
<div id="outline-container-paper-summary-2" class="outline-3">
<h3 id="paper-summary-2"><a id="sec-" name="sec-"></a>Paper summary</h3>
<div class="outline-text-3" id="text-paper-summary-2">
<p>
This paper considers a domestic hot-water provision problem in
residential buildings which equip immersion heaters and hot water tanks.
The paper present a rigorous evaluation protocol that benchmark
reinforcement learning against risk-aware heuristics. Also, the paper
provides an empirical study to show the trade-off between energy and
comfort. The obtained insights are that the performance gain mainly
comes from the access to demand-risk information.
</p>
</div>
</div>
<div id="outline-container-comments-for-authors-2" class="outline-3">
<h3 id="comments-for-authors-2"><a id="sec-" name="sec-"></a>Comments for authors</h3>
<div class="outline-text-3" id="text-comments-for-authors-2">
<p>
Strengths: - The paper studies an interesting application involving the
control of domestic hot water systems. - A PPO-based reinforcement
learning approach is implemented and compared with several rule-based
control methods.
</p>

<p>
Weaknesses: - The technical novelty appears limited. The paper primarily
evaluates existing RL and rule-based methods without proposing new
algorithms or methodological innovations. - The demand modeling only
captures a diurnal usage pattern, which seems overly simplistic and may
not adequately represent realistic demand variability. - The energy
objective does not account for time-varying electricity prices or grid
signals, which are important factors for energy-aware control in
practical deployments.
</p>

<p>
Overall recommendation: Based on the limited methodological novelty and
the simple system modeling, I recommend rejecting this paper.
</p>
</div>
</div>
</div>
<div id="outline-container-review-395b" class="outline-2">
<h2 id="review-395b"><a id="sec-" name="sec-"></a>Review #395B</h2>
<div class="outline-text-2" id="text-review-395b">
</div>
<div id="outline-container-meta-review-by-track-chair" class="outline-3">
<h3 id="meta-review-by-track-chair"><a id="sec-" name="sec-"></a>Meta Review by Track Chair</h3>
<div class="outline-text-3" id="text-meta-review-by-track-chair">
<p>
The paper is a solid application study, but the technical contribution
is limited: it mainly compares PPO against rule-based controllers with a
simplified demand model and an objective that omits key practical
signals (e.g., time-varying prices/grid incentives). The evaluation also
lacks stronger optimization baselines and a deeper analysis of PPO's
high switching behavior and robustness, which weakens the
value-of-information and deployment conclusions.
</p>
</div>
</div>
</div>
</div></div></div>
</body>
</html>
